import { UiFooter } from "@/shared/ui/ui-footer";
import { UiHeader } from "@/shared/ui/ui-header";
import { UiScrollImg } from "@/shared/ui/ui-scroll-img";
import { UiTextArea } from "@/shared/ui/ui-textarea";
import { useState } from "react";
import { UiProgressBar } from "@/shared/ui/ui-progress-bar";
import clsx from "clsx";

export function PassingTestPage() {
  const [currentTaskIndex, setCurrentTaskIndex] = useState(0);

  const imgContainer = ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"];
  const textContainer = [
    `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
    `Картинка 2: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
    `Картинка 3: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
    `Картинка 4: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
  ];
  const tasks = {
    items: [
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
      {
        imageSrcs: ["/test.jpg", "/test.jpg", "/test.jpg", "/test.jpg"],
        pathologyText: `Картинка 1: Зона трансформации (3Т) 1го типа характеризуется полной визуализацией
          всей площади стыка многослойного плоского эпителия и цилиндрического
          эпителия, включая его наиболее важный для скрининга компонент —
          границу метаплазии, расположенную на эктоцервиксе.`,
        testsQuestions: [
          {
            question: "Первичный осмотр",
            instructions: "Выберите один ответ.",
            answers: [
              "Кольпоскопическая картина адекватная ",
              "Кольпоскопическая картина неадекватная ",
            ],
            correctAnswer: 1,
          },
          {
            question: "Граница между МПЭ и ЦЭ",
            instructions:
              "Оцените видимость границы между эпителиями. Выберите один ответ.",
            answers: [
              "Визуализируется полностью",
              "Визуализируется частично",
              "Не визуализируется",
            ],
            correctAnswer: 2,
          },
        ],
      },
    ],
  };

  const handleTaskChange = (index: number) => {
    setCurrentTaskIndex (index);
    console.log(index);
  };

  return (
    <div className="flex flex-col items-center min-h-screen lg:min-h-[667px]">
      <UiHeader variant="withoutLogo" className="mt-6 [@media(max-height:930px)]:hidden" />
      <div className="flex flex-col justify-center items-center gap-3 flex-1 mb-4 px-5 mt-5">
        <UiProgressBar numOfCurrentTask={currentTaskIndex} tasks={tasks}/>
        <UiScrollImg img={tasks.items[currentTaskIndex].imageSrcs}/>
          <UiTextArea className="mt-5">
            Lorem ipsum dolor sit amet consectetur adipisicing elit. Veniam sapiente ipsum expedita voluptas architecto odio aspernatur ipsam in autem fuga! Nobis hic enim fugit, ex culpa iste fugiat quo earum.
          </UiTextArea>
        <div className="flex w-full">
          <button className={ clsx({"hidden": currentTaskIndex === 0},"mr-auto text-[#2E76AA] hover:text-[#26628A] text-[20px] font-normal cursor-pointer")} onClick={() => handleTaskChange(currentTaskIndex - 1)} disabled={currentTaskIndex === 0}>
          Назад
        </button>
        <button className={ clsx({"hidden": currentTaskIndex === tasks.items.length},"ml-auto text-[#2E76AA] hover:text-[#26628A] text-[20px] font-normal cursor-pointer")} onClick={() => handleTaskChange(currentTaskIndex + 1)} disabled={currentTaskIndex === tasks.items.length}>
          Далее
        </button>
        </div>
        <UiFooter activeStatus="test" />
      </div>
    </div>
  );
}
